Conf.Simple/src/InformationRegisters/SUI_docs/SUI_docs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>doc_n</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_countragents</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>is_barc_flow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоДокументАдресногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>cells_process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроверятьCтатусКИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверятьВладельца</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.Удалить_SUI_МобильныеКлиенты</types>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_НастройкиДокументовМобильныхУстройств/SUI_НастройкиДокументовМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиДокументовМобильныхУстройств</name>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/CommonModules/SUI_НастройкиДокументовСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьДанныеНастроекДляВыгрузки(АдресХранения = Неопределено, ВыбранныеНастройки = Неопределено) Экспорт
	
	ТаблицаРезультат = Новый ТаблицаЗначений();
	ТаблицаРезультат.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.SUI_НастройкиДокументов"));
	
	ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
	Для Каждого ВыбраннаяНастройка Из ОписаниеТипаМассив.ПривестиЗначение(ВыбранныеНастройки) Цикл
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		НоваяСтрока.Ссылка = ВыбраннаяНастройка;
		
		Если НоваяСтрока.Ссылка.Пустая() Тогда
			ТаблицаРезультат.Удалить(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Справочники.SUI_НастройкиДокументов.СформироватьДанныеДляВыгрузки(ТаблицаРезультат);
	
	НастройкиДокументов = Новый Структура();
	НастройкиДокументов.Вставить("ЭтоНастройкиДокументов", Истина);
	НастройкиДокументов.Вставить("Количество", 0);
	НастройкиДокументов.Вставить("Состав", ТаблицаРезультат.ВыгрузитьКолонку("Данные"));
	
	НастройкиДокументов.Количество = НастройкиДокументов.Состав.Количество();
	
	НастройкиДокументов = SUI_ОбщегоНазначения.ЗначениеВСтрокуXML(НастройкиДокументов);
	
	Если ТипЗнч(АдресХранения) = Тип("Строка") И ЗначениеЗаполнено(АдресХранения) Тогда
		
		Если ЭтоАдресВременногоХранилища(АдресХранения) Тогда
			Возврат ПоместитьВоВременноеХранилище(НастройкиДокументов, АдресХранения);
		ИначеЕсли СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(АдресХранения) Тогда
			Возврат ПоместитьВоВременноеХранилище(НастройкиДокументов, Новый УникальныйИдентификатор(АдресХранения));
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(АдресХранения) = Тип("УникальныйИдентификатор") Тогда
		Возврат ПоместитьВоВременноеХранилище(НастройкиДокументов, АдресХранения);
	Иначе
		Возврат НастройкиДокументов;
	КонецЕсли;

КонецФункции

Функция ПолучитьНастройкиИзФайла(АдресХранения, ПерезаписыватьСуществующие = Истина) Экспорт

	РезультатПолучения = Новый Структура();
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранения);

	Если ТипЗнч(ДвоичныеДанные) <> Тип("ДвоичныеДанные") И  ТипЗнч(ДвоичныеДанные) <> Тип("Строка") Тогда
		РезультатПолучения.Вставить("Ошибка", СтрШаблон(НСтр("ru = 'Не удалось получить файл настроек документов %1'"), SUI_SimpleКлиентСервер.Представление()));
	Иначе
	
		Попытка
			
			Если ТипЗнч(ДвоичныеДанные) =  Тип("ДвоичныеДанные") Тогда
				НастройкаXML = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
			Иначе
				НастройкаXML = ДвоичныеДанные;	
			КонецЕсли;
			
			Настройка = SUI_ОбщегоНазначения.ЗначениеИзСтрокиXML(НастройкаXML);
			
			Если ТипЗнч(Настройка) = Тип("Структура") И 
				Настройка.Свойство("ЭтоНастройкиДокументов") И 
				ТипЗнч(Настройка.ЭтоНастройкиДокументов) = Тип("Булево") И
				Настройка.ЭтоНастройкиДокументов И
				Настройка.Свойство("Количество") И
				ТипЗнч(Настройка.Количество) = Тип("Число") И
				Настройка.Свойство("Состав") И 
				ТипЗнч(Настройка.Состав) = Тип("Массив") Тогда
				
				Если Настройка.Состав.Количество() > 0 Тогда  
					РезультатПолучения.Вставить("АдресНастроек", ПоместитьВоВременноеХранилище(Настройка.Состав, АдресХранения));
					РезультатПолучения.Вставить("ПерезаписыватьСуществующие", ПерезаписыватьСуществующие);
				Иначе
					РезультатПолучения.Вставить("Ошибка", СтрШаблон(НСтр("ru = 'В загружаемом файле отсутствуют настройки документов %1'"), 
						SUI_SimpleКлиентСервер.Представление()));
				КонецЕсли;

			Иначе
				РезультатПолучения.Вставить("Ошибка", СтрШаблон(НСтр("ru = 'Загружаемый файл не является настройками документов %1'"), 
					SUI_SimpleКлиентСервер.Представление()));
			КонецЕсли;
			
		Исключение
			РезультатПолучения.Вставить("Ошибка", СтрШаблон(НСтр("ru = 'Не удалось загрузить файл настроек документов %1 по причине:
			|%2'"), SUI_SimpleКлиентСервер.Представление(), КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_НастройкиДокументовКлиентСервер.ИмяСобытия(НСтр("ru = 'Загрузка из файла'")), , 
				Метаданные.ОбщиеМодули.SUI_НастройкиДокументовСервер, , ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;

	Возврат РезультатПолучения;
	
КонецФункции

Функция ЗагрузитьВыбранныеНастройки(СтруктураЗагруженныхНастроек) Экспорт
	
	ПерезаписыватьСуществующие = СтруктураЗагруженныхНастроек.ПерезаписыватьСуществующие;
	
	МассивНастроек = ПолучитьИзВременногоХранилища(СтруктураЗагруженныхНастроек.АдресНастроек);
			
	РезультатЗагрузки = Новый Структура("Загружена", Ложь);
	
	Если МассивНастроек.Количество() = 0 Тогда
		РезультатЗагрузки.Вставить("Ошибка", СтрШаблон(НСтр("ru = 'Не переданы настройки для загрузки %1'"), 
		SUI_SimpleКлиентСервер.Представление()));		
		
	Иначе
		
		Попытка	
				
			РезультатЗагрузкиВБД = ЗагрузитьПолученныеНастройкиИзФайла(МассивНастроек, ПерезаписыватьСуществующие);
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Загруженно %1 из %2 настроек документов %3.'"),
			РезультатЗагрузкиВБД.Загруженно, РезультатЗагрузкиВБД.Всего, SUI_SimpleКлиентСервер.Представление());
			
			РезультатЗагрузки.Вставить("Сообщение", ТекстСообщения);
			РезультатЗагрузки.Загружена = Истина;
			
		Исключение
			РезультатЗагрузки.Вставить("Ошибка", СтрШаблон(НСтр("ru = 'Не удалось загрузить настройки документов %1 по причине:
			|%2'"), SUI_SimpleКлиентСервер.Представление(), КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_НастройкиДокументовКлиентСервер.ИмяСобытия(НСтр("ru = 'Загрузка из файла'")), , 
			Метаданные.ОбщиеМодули.SUI_НастройкиДокументовСервер, , ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;

	Возврат РезультатЗагрузки;
	
КонецФункции

Функция ПолучитьРеквизитыСоответствия() Экспорт
	
	РеквизитыСоответствия = Новый Соответствие();
	
	РеквизитыСоответствия.Вставить("id_countragents", Ложь);
	РеквизитыСоответствия.Вставить("id_warehouse", Ложь);
	
	Возврат РеквизитыСоответствия;
	
КонецФункции

Функция ПолучитьРеквизитыСоответствияТабличныхЧастей(Знач ТипТаблицы = Неопределено, ФиксированноеЗначение = Ложь) Экспорт
	
	Если ТипЗнч(ТипТаблицы) <> Тип("ПеречислениеСсылка.SUI_ТипыТаблицДокументовОбмена") Тогда
		ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ПустаяСсылка");
	КонецЕсли;
	
	РеквизитыСоответствия = Новый Соответствие();
	
	Если ТипТаблицы.Пустая() Или ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары") Тогда
		РеквизитыСоответствия.Вставить(ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары"), 
			РеквизитыСоответствияТаблицыТовары(ФиксированноеЗначение));
	КонецЕсли;
	
	Если ТипТаблицы.Пустая() Или ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок") Тогда
		РеквизитыСоответствия.Вставить(ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок"), 
			РеквизитыСоответствияТаблицыШтрихкодыУпаковок(ФиксированноеЗначение));
	КонецЕсли;
	
	Если ТипТаблицы.Пустая() Или ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор") Тогда
		РеквизитыСоответствия.Вставить(ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор"), 
			РеквизитыСоответствияТаблицыОтборРазмещение(ФиксированноеЗначение));
	КонецЕсли;
	
	Если ТипТаблицы.Пустая() Или ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение") Тогда
		РеквизитыСоответствия.Вставить(ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение"), 
			РеквизитыСоответствияТаблицыОтборРазмещение(ФиксированноеЗначение));
	КонецЕсли;
	
	Если ТипТаблицы.Пустая() Или ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии") Тогда
		РеквизитыСоответствия.Вставить(ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии"), 
			РеквизитыСоответствияТаблицыСерии(ФиксированноеЗначение));
	КонецЕсли;
	
	Если ТипТаблицы.Пустая() Тогда
		Возврат РеквизитыСоответствия;
	Иначе
		Возврат РеквизитыСоответствия.Получить(ТипТаблицы);
	КонецЕсли;
	
КонецФункции

Функция ИмяТипаТаблицыДокументаОбмена(ТипТаблицы) Экспорт
	
	ИндексТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Индекс(ТипТаблицы);
	Возврат Метаданные.Перечисления.SUI_ТипыТаблицДокументовОбмена.ЗначенияПеречисления[ИндексТаблицы].Имя;
	
КонецФункции

Функция ПолучитьНастройкиДокумента(Знач ДокументСсылка, ПоВыгрузкеДокумента = Ложь, Неиспользуемые = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиДокумента = Новый Массив();
	
	ИдентификаторДокумента = Неопределено;

	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ДокументСсылка) Тогда
		ИдентификаторДокумента = ДокументСсылка;
		ДокументСсылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ИдентификаторДокумента);
	КонецЕсли;
	
	Если Не SUI_ОбщегоНазначения.ЭтоСсылкаДокумента(ДокументСсылка) Или
		Не SUI_ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
		ВызватьИсключение НСтр("ru = 'Ссылка объекта не существует или не является ссылкой документа.'");
	ИначеЕсли Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		ИдентификаторДокумента = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДокументСсылка, Истина);
	КонецЕсли;

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ИмяОбъектаМетаданных", 	ДокументСсылка.Метаданные().Имя);
	Запрос.УстановитьПараметр("id_doc", 				ИдентификаторДокумента);
	Запрос.УстановитьПараметр("Неиспользуемые", 		Неиспользуемые);

	Если ПоВыгрузкеДокумента Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	SUI_docs_beta.НастройкаДокумента
			|ИЗ
			|	РегистрСведений.SUI_docs КАК SUI_docs_beta
			|ГДЕ
			|	SUI_docs_beta.id_doc = &id_doc";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	SUI_НастройкиДокументов.Ссылка КАК НастройкаДокумента
			|ИЗ
			|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
			|ГДЕ
			|	SUI_НастройкиДокументов.ИмяОбъектаМетаданных = &ИмяОбъектаМетаданных
			|	И ВЫБОР
			|		КОГДА НЕ &Неиспользуемые
			|			ТОГДА НЕ SUI_НастройкиДокументов.ПометкаУдаления
			|			И SUI_НастройкиДокументов.Используется
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ";
	КонецЕсли;
    
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Если РезультатЗапроса.Пустой() Тогда
		Возврат НастройкиДокумента;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ПоВыгрузкеДокумента Тогда
			
			Если SUI_ОбщегоНазначения.СсылкаСуществует(Выборка.НастройкаДокумента) Тогда
				НастройкиДокумента.Добавить(Выборка.НастройкаДокумента);
			КонецЕсли;
			
		Иначе
			
			//@skip-check query-in-loop
			Если ДокументСоответствуетОтборуНастройки(Выборка.НастройкаДокумента.НастройкиСхемыКомпоновкиДанных.Получить(), ДокументСсылка) Тогда
				НастройкиДокумента.Добавить(Выборка.НастройкаДокумента);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат НастройкиДокумента;
	
КонецФункции

Функция СформироватьНастройкиДокумента(НастройкаДокументаСсылка) Экспорт

	НастройкаДокумента = Новый Структура();
	
	Если ТипЗнч(НастройкаДокументаСсылка) <> Тип("СправочникСсылка.SUI_НастройкиДокументов") Тогда
		Возврат НастройкаДокумента;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_НастройкиДокументов.Ссылка КАК Ссылка,
		|	SUI_НастройкиДокументов.Наименование КАК ИмяДокументаМП,
		|	SUI_НастройкиДокументов.ИмяОбъектаМетаданных КАК ИмяМетаданных,
		|	SUI_НастройкиДокументов.СостояниеДокументаПоУмолчанию КАК СостояниеДокументаПоУмолчанию,
		|	SUI_НастройкиДокументов.КонтролироватьДокумент КАК КонтролироватьДокумент,
		|	SUI_НастройкиДокументов.ИспользуетсяМаркировка КАК ИспользуетсяМаркировка,
		|	SUI_НастройкиДокументов.ПроводитьДокумент КАК ПроводитьДокумент,
		|	SUI_НастройкиДокументов.НастройкиСхемыКомпоновкиДанных КАК НастройкиКомпоновкиДанных,
		|	SUI_НастройкиДокументов.ДополнительныеНастройки КАК ДополнительныеНастройки,
		// artem - 29.08.24 - B119267 -
		|	SUI_НастройкиДокументов.Агрегация КАК Агрегация,
		|	// 20.09.2024 - artem - B119267 >>>
		|	SUI_НастройкиДокументов.ComputerVision,
		|	SUI_НастройкиДокументов.СоздаватьДокументыНаТСД,
		|	SUI_НастройкиДокументов.АлгоритмСозданияНовогоДокумента,
		|	SUI_НастройкиДокументов.СборШтрихкодов,
		|	ВЫБОР
		|		КОГДА SUI_НастройкиДокументов.Используется И НЕ SUI_НастройкиДокументов.ПометкаУдаления
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Используется,
		// nikita - 29.08.24 - B134721 -
		|	SUI_НастройкиДокументов.ПроверятьCтатусКИ КАК ПроверятьCтатусКИ,
		|	SUI_НастройкиДокументов.ПроверятьВладельца КАК ПроверятьВладельца
		// nikita - 29.08.24 - B134721 - >>>
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
		|ГДЕ
		|	SUI_НастройкиДокументов.Ссылка = &НастройкаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоответствияРеквизитов.Ключ КАК Ключ,
		|	СоответствияРеквизитов.Значение КАК Значение
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов.СоответствияРеквизитов КАК СоответствияРеквизитов
		|ГДЕ
		|	СоответствияРеквизитов.Ссылка = &НастройкаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SUI_НастройкиДокументовНастройкиТабличныхЧастей.ТипТаблицы КАК ТипТаблицы,
		|	SUI_НастройкиДокументовНастройкиТабличныхЧастей.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти, 
		|	SUI_НастройкиДокументовНастройкиТабличныхЧастей.ПропускатьПриЗаписи КАК ПропускатьПриЗаписи,
		|	SUI_НастройкиДокументовНастройкиТабличныхЧастей.УдалятьПустыеСтроки КАК УдалятьПустыеСтроки,
		|	SUI_НастройкиДокументовСопоставлениеРеквизитовТабличныхЧастей.Поле КАК Поле,
		|	SUI_НастройкиДокументовСопоставлениеРеквизитовТабличныхЧастей.ИмяРеквизита КАК ИмяРеквизита,
		|	SUI_НастройкиДокументовСопоставлениеРеквизитовТабличныхЧастей.ИспользуетсяПостоянноеЗначение КАК ИспользуетсяПостоянноеЗначение,
		|	SUI_НастройкиДокументовСопоставлениеРеквизитовТабличныхЧастей.ПостоянноеЗначение КАК ПостоянноеЗначение
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов.НастройкиТабличныхЧастей КАК SUI_НастройкиДокументовНастройкиТабличныхЧастей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.SUI_НастройкиДокументов.СопоставлениеРеквизитовТабличныхЧастей КАК SUI_НастройкиДокументовСопоставлениеРеквизитовТабличныхЧастей
		|		ПО SUI_НастройкиДокументовНастройкиТабличныхЧастей.КлючСвязи = SUI_НастройкиДокументовСопоставлениеРеквизитовТабличныхЧастей.КлючСвязи
		|ГДЕ
		|	SUI_НастройкиДокументовНастройкиТабличныхЧастей.Ссылка = &НастройкаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SUI_НастройкиДокументовНастройкиЗаполненияРеквизитовПередЗаписью.Ключ КАК Ключ,
		|	SUI_НастройкиДокументовНастройкиЗаполненияРеквизитовПередЗаписью.Значение КАК Значение,
		|	SUI_НастройкиДокументовНастройкиЗаполненияРеквизитовПередЗаписью.ПриРасхождении КАК ПриРасхождении
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов.НастройкиЗаполненияРеквизитовПередЗаписью КАК SUI_НастройкиДокументовНастройкиЗаполненияРеквизитовПередЗаписью
		|ГДЕ
		|	SUI_НастройкиДокументовНастройкиЗаполненияРеквизитовПередЗаписью.Ссылка = &НастройкаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SUI_НастройкиДокументовНастройкиСозданияДокументовНаОснованииПослеЗаписи.Ключ КАК Ключ,
		|	SUI_НастройкиДокументовНастройкиСозданияДокументовНаОснованииПослеЗаписи.Значение КАК Значение,
		|	SUI_НастройкиДокументовНастройкиСозданияДокументовНаОснованииПослеЗаписи.Проводить КАК Проводить,
		|	SUI_НастройкиДокументовНастройкиСозданияДокументовНаОснованииПослеЗаписи.ПриРасхождении КАК ПриРасхождении
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов.НастройкиСозданияДокументовНаОснованииПослеЗаписи КАК SUI_НастройкиДокументовНастройкиСозданияДокументовНаОснованииПослеЗаписи
		|ГДЕ
		|	SUI_НастройкиДокументовНастройкиСозданияДокументовНаОснованииПослеЗаписи.Ссылка = &НастройкаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SUI_НастройкиДокументовНастройкиВыводаДополнительныхПолей.РеквизитДокумента КАК РеквизитДокумента,
		|	SUI_НастройкиДокументовНастройкиВыводаДополнительныхПолей.ИмяНаУстройстве КАК ИмяНаУстройстве
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов.НастройкиВыводаДополнительныхПолей КАК SUI_НастройкиДокументовНастройкиВыводаДополнительныхПолей
		|ГДЕ
		|	SUI_НастройкиДокументовНастройкиВыводаДополнительныхПолей.Ссылка = &НастройкаДокумента";
	
	Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокументаСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатыЗапроса[0].Пустой() Тогда
		Возврат НастройкаДокумента;
	КонецЕсли;
	
	ОсновныеНастройки = РезультатыЗапроса[0].Выбрать();
	ОсновныеНастройки.Следующий();
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ОсновныеНастройки.ИмяМетаданных);
	
	Если МетаданныеДокумента = Неопределено Тогда
		Возврат НастройкаДокумента;
	КонецЕсли;
	
	ТаблицаНастройкиРеквизитов 		= РезультатыЗапроса[1].Выгрузить();
	ТаблицаНастройкиТабличныхЧастей = РезультатыЗапроса[2].Выгрузить();
	ТаблицаУстановкиРеквизитов = РезультатыЗапроса[3].Выгрузить();
    ТаблицаСозданияДокументов = РезультатыЗапроса[4].Выгрузить();
    ТаблицаВыводаДополнительныхПолей = РезультатыЗапроса[5].Выгрузить();



	// Основные настройки
	НастройкаДокумента = Новый Структура(SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатыЗапроса[0]));
	ЗаполнитьЗначенияСвойств(НастройкаДокумента, ОсновныеНастройки);

	// Настройки компоновки данных
	Если ТипЗнч(НастройкаДокумента.НастройкиКомпоновкиДанных) <> Тип("НастройкиКомпоновкиДанных") Тогда
		НастройкаДокумента.НастройкиКомпоновкиДанных = НастройкаКомпоновкиПоПараметру(НастройкаДокумента.НастройкиКомпоновкиДанных);
	КонецЕсли;
	
	// Дополнительные настройки
	НастройкаДокумента.ДополнительныеНастройки = НастройкаДокумента.ДополнительныеНастройки.Получить();
	Если ТипЗнч(НастройкаДокумента.ДополнительныеНастройки) <> Тип("Структура") Тогда
		НастройкаДокумента.ДополнительныеНастройки = Новый Структура();
	КонецЕсли;
	
	// Реквизиты документа
	НастройкаДокумента.Вставить("Реквизиты", СформироватьНастройкиРеквизитовДокумента(ТаблицаНастройкиРеквизитов, МетаданныеДокумента));
	
	// Табличные части
	НастройкаДокумента.Вставить("ТабличныеЧасти", СформироватьНастройкиТабличныхЧастейДокумента(ТаблицаНастройкиТабличныхЧастей, МетаданныеДокумента));
	
	// Установка реквизитов
	НастройкаДокумента.Вставить("ТаблицаУстановкиРеквизитов", ТаблицаУстановкиРеквизитов);
	
	НастройкаДокумента.Вставить("ТаблицаСозданияДокументов", ТаблицаСозданияДокументов);
	
	НастройкаДокумента.Вставить("ТаблицаВыводаДополнительныхПолей", ТаблицаВыводаДополнительныхПолей);
	
	НастройкаДокумента.Вставить("ЭтоДокументАдресногоХранения", Ложь);
	
	Если НастройкаДокумента.ИмяМетаданных <> "SUI_СборШтрихкодов" Тогда
		
		Если НастройкаДокумента.ТабличныеЧасти.Количество() > 0 Тогда
			
			// Настройка документа адресного хранения
			Если НастройкаДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор) <> Неопределено Или 
				НастройкаДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение) <> Неопределено Тогда
				НастройкаДокумента.Вставить("ЭтоДокументАдресногоХранения", Истина);
			КонецЕсли;
			
		Иначе
			НастройкаДокумента = Новый Структура();
		КонецЕсли; 
		
	КонецЕсли;

	Возврат НастройкаДокумента;
	
КонецФункции

Функция ДокументСоответствуетОтборуНастройки(Знач НастройкаКомпоновкиДанных, ДокументСсылка) Экспорт
	
	Если ДокументСсылка = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	НастройкаКомпоновкиДанных = НастройкаКомпоновкиПоПараметру(НастройкаКомпоновкиДанных);
	
	Схема = SUI_КомпоновкаДанныхСервер.ПустаяСхема();
	
	НаборДанных = SUI_КомпоновкаДанныхСервер.ДобавитьПустойНаборДанных(Схема);
	НаборДанных.Запрос = "ВЫБРАТЬ * ИЗ " + ДокументСсылка.Метаданные().ПолноеИмя() + "
	|ГДЕ
	|	Ссылка = &ДокументСсылка";
	
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(НастройкаКомпоновкиДанных, "Ссылка");
	SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(Схема, "ДокументСсылка", , ДокументСсылка);
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(НастройкаКомпоновкиДанных);
	
	ПараметрыРезультата = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных(Схема, НастройкаКомпоновкиДанных);
	ПараметрыРезультата.ВыполнятьВПривилегированномРежиме = Истина;
	
	Результат = SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультата);
	
	Возврат (Результат.Количество() > 0);
	
КонецФункции

Функция НастройкаДокументаПринадлежитМобильномуКлиенту(НастройкаДокумента, МобильноеУстройство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_НастройкиДокументовМобильныхКлиентов.НастройкаДокумента
		|ИЗ
		|	РегистрСведений.SUI_НастройкиДокументовМобильныхУстройств КАК SUI_НастройкиДокументовМобильныхКлиентов
		|ГДЕ
		|	SUI_НастройкиДокументовМобильныхКлиентов.НастройкаДокумента = &НастройкаДокумента
		|	И SUI_НастройкиДокументовМобильныхКлиентов.МобильноеУстройство = &МобильноеУстройство";
	
	Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.1.7";
	Обработчик.Процедура 			= "SUI_НастройкиДокументовСервер.КонвертироватьНастройкиДокументовПриОбновлении_1_0_1_7";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Конвертация настроек документов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.5.6";
	Обработчик.Процедура 			= "SUI_НастройкиДокументовСервер.СброситьПризнакАгрегацииПриОбновлении_1_0_5_6";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Конвертация настроек документов'");
	
КонецПроцедуры

Процедура КонвертироватьНастройкиДокументовПриОбновлении_1_0_1_7() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SUI_НастройкиДокументов.Ссылка КАК Ссылка,
		|	SUI_НастройкиДокументов.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
		|ГДЕ
		|	SUI_НастройкиДокументов.Используется = SUI_НастройкиДокументов.ПометкаУдаления";
			
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.SUI_НастройкиДокументов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НастройкиОбъект = Выборка.Ссылка.ПолучитьОбъект();;
			НастройкиОбъект.Используется = Не Выборка.ПометкаУдаления;
			НастройкиОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура СброситьПризнакАгрегацииПриОбновлении_1_0_5_6() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов
		|ГДЕ
		|	ГрупповоеСканирование
		|	И Агрегация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.SUI_НастройкиДокументов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НастройкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				НастройкаОбъект.Агрегация = Ложь;
				НастройкаОбъект.ОбменДанными.Загрузка = Истина;
				
				Если НастройкаОбъект.ПроверитьЗаполнение() Тогда
					НастройкаОбъект.Записать();
				КонецЕсли;
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗагрузитьПолученныеНастройкиИзФайла(КоллекцияНастроек, ПерезаписыватьСуществующие = Истина)
	
	Результат = Новый Структура("Всего, Загруженно, Пропущено", КоллекцияНастроек.Количество(), 0, 0);
	
	Для Каждого ЭлементКоллекцииНастроек Из КоллекцияНастроек Цикл
		
		Если Не SUI_ОбщегоНазначения.СсылкаСуществует(ЭлементКоллекцииНастроек.Ссылка) Тогда
			НастройкаОбъект = Справочники.SUI_НастройкиДокументов.СоздатьЭлемент();
			//ЭлементКоллекцииНастроек.Ссылка = НастройкаОбъект.Ссылка;
			НастройкаОбъект.УстановитьСсылкуНового(ЭлементКоллекцииНастроек.Ссылка);
		Иначе
			
			Если ПерезаписыватьСуществующие Тогда
				НастройкаОбъект = ЭлементКоллекцииНастроек.Ссылка.ПолучитьОбъект();
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;

		Если ТипЗнч(НастройкаОбъект) <> Тип("СправочникОбъект.SUI_НастройкиДокументов") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Метаданные.Документы.Найти(ЭлементКоллекцииНастроек.ИмяОбъектаМетаданных) = Неопределено Тогда
			SUI_ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Документ с именем %1 не существует в текущей конфигурации.'"), ЭлементКоллекцииНастроек.ИмяОбъектаМетаданных));
			Продолжить;
		КонецЕсли;

		Попытка
			
			НастройкаОбъект.Заполнить(ЭлементКоллекцииНастроек);
			
			Если НастройкаОбъект.ПроверитьЗаполнение() Тогда
				
				НастройкаОбъект.Записать();
				
				НаборЗаписей = РегистрыСведений.SUI_НастройкиДокументовМобильныхУстройств.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.НастройкаДокумента.Установить(НастройкаОбъект.Ссылка);
				НаборЗаписей.Заполнить(Новый Структура());
				НаборЗаписей.Записать(Истина);
				
				Результат.Загруженно = Результат.Загруженно + 1;
				
			КонецЕсли;
			
		Исключение
			ВызватьИсключение;
		КонецПопытки;

	КонецЦикла;
	
	Результат.Пропущено = Результат.Всего - Результат.Загруженно;
	
	Возврат Результат;
	
КонецФункции

// Получить внешнее имя реквизита.
// 
// Параметры:
//  ИмяРеквизита - Строка - Имя реквизита
// 
// Возвращаемое значение:
//  Строка - Внешнее имя реквизита
Функция ПолучитьВнешнееИмяРеквизита(ИмяРеквизита)
	
	Если НРег(ИмяРеквизита) = "контрагент" Тогда
		Возврат "id_countragents";
	ИначеЕсли НРег(ИмяРеквизита) = "склад" Тогда
		Возврат "id_warehouse";
	ИначеЕсли НРег(ИмяРеквизита) = "номенклатура" Тогда
		Возврат "id_good";
	ИначеЕсли НРег(ИмяРеквизита) = "характеристика" Тогда
		Возврат "id_properties";
	ИначеЕсли НРег(ИмяРеквизита) = "серия" Тогда
		Возврат "id_series";
	ИначеЕсли НРег(ИмяРеквизита) = "статусуказаниясерий" Тогда
		Возврат "use_series";
	ИначеЕсли НРег(ИмяРеквизита) = "упаковка" Тогда
		Возврат "id_unit";
	ИначеЕсли НРег(ИмяРеквизита) = "ячейка" Тогда
		Возврат "id_cell";
	ИначеЕсли НРег(ИмяРеквизита) = "видцены" Тогда
		Возврат "id_price";
	ИначеЕсли НРег(ИмяРеквизита) = "цена" Тогда
		Возврат "price";
	ИначеЕсли НРег(ИмяРеквизита) = "штрихкодупаковки" Тогда
		Возврат "id_marking_code";
	ИначеЕсли НРег(ИмяРеквизита) = "значениештрихкода" Тогда
		Возврат "mark_code";
	ИначеЕсли НРег(ИмяРеквизита) = "количествоплан" Тогда
		Возврат "qtty_plan";
	ИначеЕсли НРег(ИмяРеквизита) = "количествофакт" Тогда
		Возврат "qtty";
	ИначеЕсли НРег(ИмяРеквизита) = "номер" Тогда
		Возврат "doc_n";
	ИначеЕсли НРег(ИмяРеквизита) = "дата" Тогда
		Возврат "doc_date";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция СоответствиеРеквизитов(ОписаниеМетаданных, СоответствияРеквизитов, ТипТаблицы = Неопределено)
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
		ОбязательныеРеквизиты = ОбязательноеСопоставлениеРеквизитовТаблицыТовары();
	ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
		ОбязательныеРеквизиты = ОбязательноеСопоставлениеРеквизитовТаблицыШтрихкодыУпаковок();
	ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
		ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
		ОбязательныеРеквизиты = ОбязательноеСопоставлениеРеквизитовТаблицыОтборРазмещение();
	ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
		ОбязательныеРеквизиты = ОбязательноеСопоставлениеРеквизитовТаблицыСерии();
	Иначе
		ОбязательныеРеквизиты = Новый Соответствие();
	КонецЕсли;
	
	СоответствияРеквизитовКопия = Новый Соответствие();
	
	Для Каждого СоответствиеРеквизита Из СоответствияРеквизитов Цикл
		
		ВнешнееИмяРеквизита = ПолучитьВнешнееИмяРеквизита(СоответствиеРеквизита.Ключ);
		
		сткСоответствиеРеквизита = Новый Структура("Тип, Имя, ПостоянноеЗначение");
		
		Если СоответствиеРеквизита.Значение.ИмяРеквизита = Неопределено И
			СоответствиеРеквизита.Значение.ПостоянноеЗначение <> Неопределено Тогда
			
			сткСоответствиеРеквизита.ПостоянноеЗначение = СоответствиеРеквизита.Значение.ПостоянноеЗначение;
			сткСоответствиеРеквизита.Тип = Новый ОписаниеТипов(SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
				ТипЗнч(СоответствиеРеквизита.Значение.ПостоянноеЗначение)));

		ИначеЕсли СоответствиеРеквизита.Значение.ИмяРеквизита <> Неопределено И
			СоответствиеРеквизита.Значение.ПостоянноеЗначение = Неопределено Тогда 
			
			МетаданныеРеквизита = ОписаниеМетаданных.Реквизиты.Найти(СоответствиеРеквизита.Значение.ИмяРеквизита);
			
			Если МетаданныеРеквизита = Неопределено Тогда
			
				Если SUI_ОбщегоНазначения.ЭтоСтандартныйРеквизит(ОписаниеМетаданных.СтандартныеРеквизиты, СоответствиеРеквизита.Значение.ИмяРеквизита) Тогда
					МетаданныеРеквизита = ОписаниеМетаданных.СтандартныеРеквизиты[СоответствиеРеквизита.Значение.ИмяРеквизита];
				КонецЕсли;
				
			КонецЕсли;
			
			Если МетаданныеРеквизита <> Неопределено Тогда
				сткСоответствиеРеквизита.Имя = МетаданныеРеквизита.Имя;
				сткСоответствиеРеквизита.Тип = МетаданныеРеквизита.Тип;
			КонецЕсли;
			
		КонецЕсли;
		
		Если сткСоответствиеРеквизита.Тип = Неопределено Тогда
			
			Если ЗначениеЗаполнено(ОбязательныеРеквизиты) Тогда
				
				ОбязательныйРеквизит = ОбязательныеРеквизиты.Получить(СоответствиеРеквизита.Ключ);
				
				Если ОбязательныйРеквизит <> Неопределено И ОбязательныйРеквизит Тогда
					СоответствияРеквизитовКопия = Новый Соответствие();
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
			СоответствияРеквизитовКопия.Вставить(ВнешнееИмяРеквизита, Неопределено);
			
		Иначе
			СоответствияРеквизитовКопия.Вставить(ВнешнееИмяРеквизита, сткСоответствиеРеквизита);
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(СоответствияРеквизитовКопия);
	
КонецФункции

Функция СформироватьНастройкиРеквизитовДокумента(НастройкиРеквизитовСтроки, МетаданныеДокумента)
	
	НастройкиРеквизитов = Новый Соответствие();
	
	НастройкиРеквизитов.Вставить(ПолучитьВнешнееИмяРеквизита("Номер"), Новый Структура("ИмяРеквизита, ПостоянноеЗначение", "Номер"));
	НастройкиРеквизитов.Вставить(ПолучитьВнешнееИмяРеквизита("Дата"), Новый Структура("ИмяРеквизита, ПостоянноеЗначение", "Дата"));
	
	Для Каждого СтрокаНастройкиРеквизитов Из НастройкиРеквизитовСтроки Цикл
		НастройкиРеквизитов.Вставить(ПолучитьВнешнееИмяРеквизита(СтрокаНастройкиРеквизитов.Ключ), 
			Новый Структура("ИмяРеквизита, ПостоянноеЗначение", СтрокаНастройкиРеквизитов.Значение));
	КонецЦикла;

	Возврат СоответствиеРеквизитов(МетаданныеДокумента, НастройкиРеквизитов);

КонецФункции

Функция СформироватьНастройкиТабличныхЧастейДокумента(ТаблицаНастройкиТабличныхЧастей, МетаданныеДокумента)
	
	НастройкиТабличныхЧастей = Новый Соответствие();
	
	ТаблицаВерхнегоУровня = ТаблицаНастройкиТабличныхЧастей.Скопировать();
	ТаблицаВерхнегоУровня.Свернуть("ТипТаблицы, ИмяТабличнойЧасти, УдалятьПустыеСтроки, ПропускатьПриЗаписи");

	Для Каждого СтрокаТаблицыВерхнегоУровня Из ТаблицаВерхнегоУровня Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицыВерхнегоУровня.ТипТаблицы) Тогда
			Продолжить;
		КонецЕсли;

		МетаданныеТабличнойЧасти = МетаданныеДокумента.ТабличныеЧасти.Найти(СтрокаТаблицыВерхнегоУровня.ИмяТабличнойЧасти);
		
		Если МетаданныеТабличнойЧасти = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НастройкиРеквизитов = Новый Соответствие();

		СтрокиТаблицыНижнегоУровня = ТаблицаНастройкиТабличныхЧастей.НайтиСтроки(
			Новый Структура("ТипТаблицы, ИмяТабличнойЧасти", СтрокаТаблицыВерхнегоУровня.ТипТаблицы, СтрокаТаблицыВерхнегоУровня.ИмяТабличнойЧасти));

		Для Каждого СтрокаТаблицыНижнегоУровня Из СтрокиТаблицыНижнегоУровня Цикл
			
			Значение = Новый Структура("ИмяРеквизита, ПостоянноеЗначение");
			Если СтрокаТаблицыНижнегоУровня.ИспользуетсяПостоянноеЗначение Тогда
				Значение.ПостоянноеЗначение = СтрокаТаблицыНижнегоУровня.ПостоянноеЗначение;
			Иначе
				Значение.ИмяРеквизита = СтрокаТаблицыНижнегоУровня.ИмяРеквизита;
			КонецЕсли;
			
			НастройкиРеквизитов.Вставить(СтрокаТаблицыНижнегоУровня.Поле, Значение);
			
		КонецЦикла;

		НастройкаТабличнойЧасти = Новый Структура();
		НастройкаТабличнойЧасти.Вставить("ТипТаблицы", СтрокаТаблицыВерхнегоУровня.ТипТаблицы);
		НастройкаТабличнойЧасти.Вставить("ИмяТабличнойЧасти", СтрокаТаблицыВерхнегоУровня.ИмяТабличнойЧасти);
		НастройкаТабличнойЧасти.Вставить("УдалятьПустыеСтроки", СтрокаТаблицыВерхнегоУровня.УдалятьПустыеСтроки);
		НастройкаТабличнойЧасти.Вставить("ПропускатьПриЗаписи", СтрокаТаблицыВерхнегоУровня.ПропускатьПриЗаписи);
	
		НастройкаТабличнойЧасти.Вставить("Элементы", 
			СоответствиеРеквизитов(МетаданныеТабличнойЧасти, НастройкиРеквизитов, НастройкаТабличнойЧасти.ТипТаблицы));
		
		Если Не ЗначениеЗаполнено(НастройкаТабличнойЧасти.Элементы) Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкиТабличныхЧастей.Вставить(СтрокаТаблицыВерхнегоУровня.ТипТаблицы, НастройкаТабличнойЧасти);
		
	КонецЦикла;

	Возврат НастройкиТабличныхЧастей;

КонецФункции

Функция РеквизитыСоответствияТаблицыТовары(ФиксированноеЗначение = Истина)
	
	РеквизитыСоответствия = Новый Соответствие();

	РеквизитыСоответствия.Вставить("Номенклатура", 		Истина);
	РеквизитыСоответствия.Вставить("Характеристика", 	Ложь);
	РеквизитыСоответствия.Вставить("Серия", 			Ложь);
	РеквизитыСоответствия.Вставить("СтатусУказанияСерий", Ложь);
	РеквизитыСоответствия.Вставить("Упаковка", 			Ложь);
	РеквизитыСоответствия.Вставить("Ячейка", 			Ложь);
	РеквизитыСоответствия.Вставить("ВидЦены", 			Ложь);
	РеквизитыСоответствия.Вставить("Цена", 				Ложь);
	РеквизитыСоответствия.Вставить("КоличествоПлан", 	Истина);
	РеквизитыСоответствия.Вставить("КоличествоФакт", 	Истина);
	
	Если ФиксированноеЗначение Тогда
		Возврат Новый ФиксированноеСоответствие(РеквизитыСоответствия);
	Иначе
		Возврат РеквизитыСоответствия;
	КонецЕсли;
	
КонецФункции

Функция РеквизитыСоответствияТаблицыШтрихкодыУпаковок(ФиксированноеЗначение = Истина)
	
	РеквизитыСоответствия = Новый Соответствие();

	РеквизитыСоответствия.Вставить("ШтрихкодУпаковки", Истина);
	
	Если ФиксированноеЗначение Тогда
		Возврат Новый ФиксированноеСоответствие(РеквизитыСоответствия);
	Иначе
		Возврат РеквизитыСоответствия;
	КонецЕсли;
	
КонецФункции

Функция РеквизитыСоответствияТаблицыОтборРазмещение(ФиксированноеЗначение = Истина)
	
	РеквизитыСоответствия = РеквизитыСоответствияТаблицыТовары(Ложь);

	РеквизитыСоответствия.Удалить("ВидЦены");
	РеквизитыСоответствия.Удалить("Цена");
	
	РеквизитыСоответствия.Вставить("Ячейка", Истина);
	
	Если ФиксированноеЗначение Тогда
		Возврат Новый ФиксированноеСоответствие(РеквизитыСоответствия);
	Иначе
		Возврат РеквизитыСоответствия;
	КонецЕсли;
	
КонецФункции

Функция РеквизитыСоответствияТаблицыСерии(ФиксированноеЗначение = Истина)
	
	РеквизитыСоответствия = Новый Соответствие();

	РеквизитыСоответствия.Вставить("Номенклатура", 		Истина);
	РеквизитыСоответствия.Вставить("Характеристика", 	Ложь);
	РеквизитыСоответствия.Вставить("Серия", 			Истина);
	РеквизитыСоответствия.Вставить("Склад", 			Ложь);
	РеквизитыСоответствия.Вставить("КоличествоФакт",	Ложь);
	
	Если ФиксированноеЗначение Тогда
		Возврат Новый ФиксированноеСоответствие(РеквизитыСоответствия);
	Иначе
		Возврат РеквизитыСоответствия;
	КонецЕсли;
	
КонецФункции

Функция ОбязательноеСопоставлениеРеквизитовТаблицыТовары(ФиксированноеЗначение = Истина)
	
	ОбязательныеРеквизиты = Новый Соответствие();

	ОбязательныеРеквизиты.Вставить("id_good", 		Истина);
	ОбязательныеРеквизиты.Вставить("id_properties", Ложь);
	ОбязательныеРеквизиты.Вставить("id_series", 	Ложь);
	ОбязательныеРеквизиты.Вставить("use_series", 	Ложь);
	ОбязательныеРеквизиты.Вставить("id_cell", 		Ложь);
	ОбязательныеРеквизиты.Вставить("qtty", 			Истина);
	ОбязательныеРеквизиты.Вставить("qtty_plan", 	Истина);
	ОбязательныеРеквизиты.Вставить("id_price", 		Ложь);
	ОбязательныеРеквизиты.Вставить("id_unit", 		Ложь);
	ОбязательныеРеквизиты.Вставить("price", 		Ложь);
	
	Если ФиксированноеЗначение Тогда
		Возврат Новый ФиксированноеСоответствие(ОбязательныеРеквизиты);
	Иначе
		Возврат ОбязательныеРеквизиты;
	КонецЕсли;
	
КонецФункции

Функция ОбязательноеСопоставлениеРеквизитовТаблицыШтрихкодыУпаковок(ФиксированноеЗначение = Истина)
	
	ОбязательныеРеквизиты = Новый Соответствие();

	ОбязательныеРеквизиты.Вставить("id_marking_code", Истина);
	
	Если ФиксированноеЗначение Тогда
		Возврат Новый ФиксированноеСоответствие(ОбязательныеРеквизиты);
	Иначе
		Возврат ОбязательныеРеквизиты;
	КонецЕсли;
	
КонецФункции

Функция ОбязательноеСопоставлениеРеквизитовТаблицыОтборРазмещение(ФиксированноеЗначение = Истина)
	
	ОбязательныеРеквизиты = ОбязательноеСопоставлениеРеквизитовТаблицыТовары(Ложь);
	
	ОбязательныеРеквизиты.Удалить("id_price");
	ОбязательныеРеквизиты.Удалить("price");
	
	ОбязательныеРеквизиты.Вставить("id_cell", Истина);
	
	Если ФиксированноеЗначение Тогда
		Возврат Новый ФиксированноеСоответствие(ОбязательныеРеквизиты);
	Иначе
		Возврат ОбязательныеРеквизиты;
	КонецЕсли;
	
КонецФункции

Функция ОбязательноеСопоставлениеРеквизитовТаблицыСерии(ФиксированноеЗначение = Истина)
	
	ОбязательныеРеквизиты = Новый Соответствие();

	ОбязательныеРеквизиты.Вставить("id_good", 		Истина);
	ОбязательныеРеквизиты.Вставить("id_properties", Ложь);
	ОбязательныеРеквизиты.Вставить("id_series", 	Истина);
	ОбязательныеРеквизиты.Вставить("id_warehouse", 	Ложь);
	
	Если ФиксированноеЗначение Тогда
		Возврат Новый ФиксированноеСоответствие(ОбязательныеРеквизиты);
	Иначе
		Возврат ОбязательныеРеквизиты;
	КонецЕсли;
	
КонецФункции

Функция НастройкаКомпоновкиПоПараметру(Знач НастройкаКомпоновки)
	
	Если ТипЗнч(НастройкаКомпоновки) = Тип("СправочникСсылка.SUI_НастройкиДокументов") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	SUI_НастройкиДокументов.НастройкиСхемыКомпоновкиДанных
			|ИЗ
			|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
			|ГДЕ
			|	SUI_НастройкиДокументов.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", НастройкаКомпоновки);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		НастройкаКомпоновки = Выборка.НастройкиСхемыКомпоновкиДанных.Получить();
	ИначеЕсли ТипЗнч(НастройкаКомпоновки) = Тип("ХранилищеЗначения") Тогда
		НастройкаКомпоновки = НастройкаКомпоновки.Получить();
	КонецЕсли;
	
	Если ТипЗнч(НастройкаКомпоновки) = Тип("НастройкиКомпоновкиДанных") Тогда
		Возврат НастройкаКомпоновки;
	Иначе
		Возврат Новый НастройкиКомпоновкиДанных();
	КонецЕсли;
	
КонецФункции

#КонецОбласти
